nxp-mcuxpresso/mcux-sdk/devices/KW45Z41083/mcuxpresso/startup_kw45z41083.cpp
WEAK void I3C0_IRQHandler(void)
{   I3C0_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{   LPSPI0_DriverIRQHandler();
}

WEAK void LPSPI1_IRQHandler(void)
{   LPSPI1_DriverIRQHandler();
}

WEAK void LPUART0_IRQHandler(void)
{   LPUART0_DriverIRQHandler();
}

WEAK void LPUART1_IRQHandler(void)
{   LPUART1_DriverIRQHandler();
}

WEAK void FLEXIO0_IRQHandler(void)
{   FLEXIO0_DriverIRQHandler();
}

WEAK void CAN0_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void Reserved64_IRQHandler(void)
{   Reserved64_DriverIRQHandler();
}

WEAK void Reserved65_IRQHandler(void)
{   Reserved65_DriverIRQHandler();
}

WEAK void Reserved66_IRQHandler(void)
{   Reserved66_DriverIRQHandler();
}

WEAK void Reserved67_IRQHandler(void)
{   Reserved67_DriverIRQHandler();
}

WEAK void Reserved68_IRQHandler(void)
{   Reserved68_DriverIRQHandler();
}

WEAK void Reserved69_IRQHandler(void)
{   Reserved69_DriverIRQHandler();
}

WEAK void Reserved70_IRQHandler(void)
{   Reserved70_DriverIRQHandler();
}

WEAK void Reserved71_IRQHandler(void)
{   Reserved71_DriverIRQHandler();
}

WEAK void Reserved72_IRQHandler(void)
{   Reserved72_DriverIRQHandler();
}

WEAK void Reserved73_IRQHandler(void)
{   Reserved73_DriverIRQHandler();
}

WEAK void Reserved74_IRQHandler(void)
{   Reserved74_DriverIRQHandler();
}

WEAK void GPIOA_INT0_IRQHandler(void)
{   GPIOA_INT0_DriverIRQHandler();
}

WEAK void GPIOA_INT1_IRQHandler(void)
{   GPIOA_INT1_DriverIRQHandler();
}

WEAK void GPIOB_INT0_IRQHandler(void)
{   GPIOB_INT0_DriverIRQHandler();
}

WEAK void GPIOB_INT1_IRQHandler(void)
{   GPIOB_INT1_DriverIRQHandler();
}

WEAK void GPIOC_INT0_IRQHandler(void)
{   GPIOC_INT0_DriverIRQHandler();
}

WEAK void GPIOC_INT1_IRQHandler(void)
{   GPIOC_INT1_DriverIRQHandler();
}

WEAK void GPIOD_INT0_IRQHandler(void)
{   GPIOD_INT0_DriverIRQHandler();
}

WEAK void GPIOD_INT1_IRQHandler(void)
{   GPIOD_INT1_DriverIRQHandler();
}

WEAK void PORTA_EFT_IRQHandler(void)
{   PORTA_EFT_DriverIRQHandler();
}

WEAK void PORTB_EFT_IRQHandler(void)
{   PORTB_EFT_DriverIRQHandler();
}

WEAK void PORTC_EFT_IRQHandler(void)
{   PORTC_EFT_DriverIRQHandler();
}

WEAK void PORTD_EFT_IRQHandler(void)
{   PORTD_EFT_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{   ADC0_DriverIRQHandler();
}

WEAK void LPCMP0_IRQHandler(void)
{   LPCMP0_DriverIRQHandler();
}

WEAK void LPCMP1_IRQHandler(void)
{   LPCMP1_DriverIRQHandler();
}

WEAK void VBAT_IRQHandler(void)
{   VBAT_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
